# Chapter 10: Data Aggregation and Group Operation

In [1]:
# Categorizing a dataset and applying a function to each group
# Aggregation / Transformation.

In [2]:
import os

# Change my directory to where the dataset lives in
os.chdir('pydata-book/')
os.getcwd()

'/Users/Study/pydata-book'

In [3]:
# Pandas's groupby - allow you to slice/dice and summarize
# dataset in an easy way. You can perform complex group
# operation by using any function that accepts a pandas 
# object or numpy array.

# Learn how to:
# 1. Split a pandas object into pieces (by keys)
# 2. Calculate group summary statistics (count, mean, sd, f)
# 3. Apply within group transformation / manipulation
#    such as normalization, linear regression, rank, subset
# 4. Compute pivot table and cross tabulations
# 5. Perform quatile analysis and statistical group analysis

In [4]:
# Aggregation of time series data - is known as RESAMPLING
# see chapter 11 next.

In [5]:
import pandas as pd
import numpy as np

In [6]:
# Think of group operation as split-apply-combine

# 1. Data are split into groups by one/more keys
#    It can be done on a particular axis (rows, axis=0)
#    or (coloumns, axis=1)

# 2. Then a function (such as sum) is applied to each group
#    and it produces a new value

# 3. Finally the reuslts are combined into a result object

In [7]:
# To start, here is a small tabular datasets (DataFrame)
df = pd.DataFrame({
    'key1': 'a a b b a'.split(),
    'key2': 'one two one two one'.split(),
    'data1': np.random.randn(5),
    'data2': np.random.randn(5)
})

In [8]:
df

  key1 key2     data1     data2
0    a  one -1.790347  1.350413
1    a  two  0.777589 -1.018241
2    b  one  0.227022 -0.491613
3    b  two  0.144897 -0.101512
4    a  one -0.400782  0.255523

In [9]:
# Suppose you want to compute the mean (average) of data1
# using labels from key1.

# grouped is a groupby object
grouped = df['data1'].groupby(df['key1'])

In [10]:
grouped.mean()

key1
a   -0.471180
b    0.185959
Name: data1, dtype: float64

In [11]:
# Passing multiple arrays as a list
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [12]:
means

key1  key2
a     one    -1.095564
      two     0.777589
b     one     0.227022
      two     0.144897
Name: data1, dtype: float64

In [13]:
means.unstack()

key2       one       two
key1
a    -1.095564  0.777589
b     0.227022  0.144897

In [14]:
states = np.array('Ohio California California Ohio Ohio'.split())
years = np.array([2005, 2005, 2006, 2005, 2006])

In [15]:
df['data1'].groupby([states, years]).mean()

California  2005    0.777589
            2006    0.227022
Ohio        2005   -0.822725
            2006   -0.400782
Name: data1, dtype: float64

In [16]:
df

  key1 key2     data1     data2
0    a  one -1.790347  1.350413
1    a  two  0.777589 -1.018241
2    b  one  0.227022 -0.491613
3    b  two  0.144897 -0.101512
4    a  one -0.400782  0.255523

In [17]:
# You get the A and B average for data1 and data2
df.groupby('key1').mean()

         data1     data2
key1
a    -0.471180  0.195898
b     0.185959 -0.296562

In [18]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -1.095564  0.802968
     two   0.777589 -1.018241
b    one   0.227022 -0.491613
     two   0.144897 -0.101512

In [19]:
# A generally useful groupby method
# Return the group sizes
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [20]:
df

  key1 key2     data1     data2
0    a  one -1.790347  1.350413
1    a  two  0.777589 -1.018241
2    b  one  0.227022 -0.491613
3    b  two  0.144897 -0.101512
4    a  one -0.400782  0.255523

In [21]:
# This can be an interesting way to display it to the terminal
# or printing it out to user
for name, group in df.groupby(['key1']):
    print('name:', name)
    print(group)

name: a
  key1 key2     data1     data2
0    a  one -1.790347  1.350413
1    a  two  0.777589 -1.018241
4    a  one -0.400782  0.255523
name: b
  key1 key2     data1     data2
2    b  one  0.227022 -0.491613
3    b  two  0.144897 -0.101512

In [22]:
# When there are multiple keys
# The first element becomes a tuple of key values
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -1.790347  1.350413
4    a  one -0.400782  0.255523
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.777589 -1.018241
('b', 'one')
  key1 key2     data1     data2
2    b  one  0.227022 -0.491613
('b', 'two')
  key1 key2     data1     data2
3    b  two  0.144897 -0.101512

In [23]:
list(df.groupby('key1'))

[('a',   key1 key2     data1     data2
  0    a  one -1.790347  1.350413
  1    a  two  0.777589 -1.018241
  4    a  one -0.400782  0.255523), ('b',   key1 key2     data1     data2
  2    b  one  0.227022 -0.491613
  3    b  two  0.144897 -0.101512)]

In [24]:
pieces = dict(list(df.groupby('key1')))
pieces['b']

  key1 key2     data1     data2
2    b  one  0.227022 -0.491613
3    b  two  0.144897 -0.101512

In [25]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [26]:
# Group by column example
grouped = df.groupby(df.dtypes, axis=1)
grouped

In [27]:
# The group is actually a grouped DataFrame
for name, group in grouped:
    print(name)
    print(type(group))
    print(group)

float64
<class 'pandas.core.frame.DataFrame'>
      data1     data2
0 -1.790347  1.350413
1  0.777589 -1.018241
2  0.227022 -0.491613
3  0.144897 -0.101512
4 -0.400782  0.255523
object
<class 'pandas.core.frame.DataFrame'>
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [28]:
# Selecting a Column or Subset of Columns
df.groupby('key1')['data1']
df.groupby('key1')[['data2']]

In [29]:
# The same as this, only syntactic surgar difference
# (Programming looks different but do the same thing)
df['data1'].groupby(df['key1'])
df[['data2']].groupby(df['key1'])

In [30]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.802968
     two  -1.018241
b    one  -0.491613
     two  -0.101512

In [31]:
# My practice
df.groupby(['key1', 'key2'])['data2'].mean()

key1  key2
a     one     0.802968
      two    -1.018241
b     one    -0.491613
      two    -0.101512
Name: data2, dtype: float64

In [32]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [33]:
s_grouped

In [34]:
s_grouped.mean()

key1  key2
a     one     0.802968
      two    -1.018241
b     one    -0.491613
      two    -0.101512
Name: data2, dtype: float64

In [35]:
# Grouping with Dicts and Series
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

# Index location
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA Values
people

               a         b         c         d         e
Joe     0.325318  1.034553  0.743235 -0.223848  0.582743
Steve   1.863139 -2.116378  1.096858 -0.419365 -0.523018
Wes     0.059780       NaN       NaN  0.337241  1.225491
Jim     0.667682 -0.374333  0.482166  0.061277 -2.147449
Travis -1.509981 -0.047447 -0.378361  1.240629  0.330937

In [36]:
mapping = {
    'a': 'red',
    'b': 'red',
    'c': 'blue',
    'd': 'blue',
    'e': 'red',
    'f': 'range'
}

In [37]:
# Cross referencing the column names by column
# Mapping the column letters into color code
by_column = people.groupby(mapping, axis=1)

In [38]:
by_column.sum()

            blue       red
Joe     0.519387  1.942614
Steve   0.677492 -0.776257
Wes     0.337241  1.285271
Jim     0.543444 -1.854100
Travis  0.862268 -1.226492

In [39]:
# The mapping columns / row by a dictionary
# also works for series too
map_series = pd.Series(mapping)
map_series

a      red
b      red
c     blue
d     blue
e      red
f    range
dtype: object

In [40]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [41]:
# While grouping (groupby) dictionary and series are nice
# The most powerful way is grouping with python function

In [42]:
# Count how many times a name is a particular length
# the index is being group by length of the string
people.groupby(len).count()

   a  b  c  d  e
3  3  2  2  3  3
5  1  1  1  1  1
6  1  1  1  1  1

In [43]:
people

               a         b         c         d         e
Joe     0.325318  1.034553  0.743235 -0.223848  0.582743
Steve   1.863139 -2.116378  1.096858 -0.419365 -0.523018
Wes     0.059780       NaN       NaN  0.337241  1.225491
Jim     0.667682 -0.374333  0.482166  0.061277 -2.147449
Travis -1.509981 -0.047447 -0.378361  1.240629  0.330937

In [44]:
# mixing function and arrays
key_list = ['one', 'one', 'one', 'two', 'two']

# Assign addtional key
# Joe = One
# Steve = One
# Wes = One
# etc
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  0.059780  1.034553  0.743235 -0.223848  0.582743
  two  0.667682 -0.374333  0.482166  0.061277 -2.147449
5 one  1.863139 -2.116378  1.096858 -0.419365 -0.523018
6 two -1.509981 -0.047447 -0.378361  1.240629  0.330937

In [45]:
# hierarchically indexed dataset
columns = pd.MultiIndex.from_arrays(['US US US JP JP'.split(),
                                    [1, 3, 5, 1, 3]],
                                    names=['cty', 'tenor'])

In [46]:
columns

MultiIndex(levels=[['JP', 'US'], [1, 3, 5]],
           codes=[[1, 1, 1, 0, 0], [0, 1, 2, 0, 1]],
           names=['cty', 'tenor'])

In [47]:
hier_df = pd.DataFrame(np.random.randn(4, 5),
                       columns=columns)

In [48]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      1.951081  0.161419 -0.490927  0.784197  0.108508
1      0.406167 -1.019289 -1.260311  0.388535 -0.068910
2     -0.681780  0.330028 -1.234369  0.867397  0.339217
3     -0.294981 -0.380421  0.765443 -1.752801 -1.587045

In [49]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [ ]:
# Sample of optimized groupby methods
# count, sum, mean, median, std, var,
# min, max, prod, first, last

In [ ]:
# Internally group by efficently slices up the series
# call the groupby methods for each piece
# and then assembles those results together into result object

In [50]:
df

  key1 key2     data1     data2
0    a  one -1.790347  1.350413
1    a  two  0.777589 -1.018241
2    b  one  0.227022 -0.491613
3    b  two  0.144897 -0.101512
4    a  one -0.400782  0.255523

In [52]:
grouped = df.groupby('key1')
grouped['data1'].quantile(0.9)

key1
a    0.541915
b    0.218809
Name: data1, dtype: float64